---
title: Connect Python with MySQL
description: Example post of connecting Python to MySQL database
author: Tim Trice
slug: connect-python-mysql
categories:
  - Python
  - MySQL
tags:
  - connection
weight: 1000000
output:
    blogdown::html_page:
        toc: true
draft: true
---

[Access MySQL from Python Notebook using MySQLdb](http://support.datascientistworkbench.com/knowledgebase/articles/831621-access-mysql-from-python-notebook-using-mysqldb)

In [1]:
import MySQLdb

In [2]:
#Enter the values for you database connection
dsn_hostname = "mysql"
dsn_port = 3306
dsn_uid = "root"
dsn_pwd = "e99rntuUXMGHB6Zt"

In [3]:
conn = MySQLdb.connect(host=dsn_hostname, port=dsn_port, user=dsn_uid, passwd=dsn_pwd)

In [4]:
conn.query("""CREATE DATABASE IF NOT EXISTS practice""")
conn.query("""USE Examples""")
conn.query("""DROP TABLE IF NOT EXISTS Cars""")
conn.query("""CREATE TABLE Cars(Id INTEGER PRIMARY KEY, Name VARCHAR(20), Price INT)""")
conn.query("""INSERT INTO Cars VALUES(1,'Audi',52642)""")
conn.query("""INSERT INTO Cars VALUES(2,'Mercedes',57127)""")
conn.query("""INSERT INTO Cars VALUES(3,'Skoda',9000)""")
conn.query("""INSERT INTO Cars VALUES(4,'Volvo',29000)""")
conn.query("""INSERT INTO Cars VALUES(5,'Bentley',350000)""")
conn.query("""INSERT INTO Cars VALUES(6,'Citroen',21000)""")
conn.query("""INSERT INTO Cars VALUES(7,'Hummer',41400)""")
conn.query("""INSERT INTO Cars VALUES(8,'Volkswagen',21600)""")

In [5]:
cursor=conn.cursor()
cursor.execute("""SELECT * FROM Cars""")
cursor.fetchone()

(1, 'Audi', 52642)

In [6]:
print ("\nShow me the records:\n")
rows = cursor.fetchall()
import pprint
pprint.pprint(rows)

Show me the records:

((2, 'Mercedes', 57127),
 (3, 'Skoda', 9000),
 (4, 'Volvo', 29000),
 (5, 'Bentley', 350000),
 (6, 'Citroen', 21000),
 (7, 'Hummer', 41400),
 (8, 'Volkswagen', 21600))

In [7]:
conn.close()